app/controllers/citations_controller.rb

  def index
    @citations = Citation.where(user_id: current_user.id)
---
SELECT `citations`.* FROM `citations` WHERE `citations`.`user_id` = 1

  def edit
    @citation = Citation.find_by_id(params[:id])
---
SELECT  `citations`.* FROM `citations` WHERE `citations`.`id` = 1 LIMIT 1

  def create
    @citation = Citation.new(citation_params)
    @citation.user_id = current_user.id
    puts @citation
    if @citation.save
---
INSERT INTO `citations` (`title`, `link`, `note`, `user_id`, `created_at`, `updated_at`) VALUES ('ldskjfklj', 'ljlkjlkj', 'lkjlkjlkj', 1, '2016-11-03 12:56:12.857898', '2016-11-03 12:56:12.857898')

  def update
    @citation = Citation.find_by_id(params[:id])
    if @citation.update(citation_params)
---
SELECT  `citations`.* FROM `citations` WHERE `citations`.`id` = 2 LIMIT 1
UPDATE `citations` SET `title` = 'Good times in the hood', `link` = 'https://careercup.com/question?id=5676572716564480', `updated_at` = '2016-11-03 16:01:58.185111' WHERE `citations`.`id` = 1

  def destroy
    @citation = Citation.find_by_id(params[:id])
    @citation.destroy
---
SELECT  `citations`.* FROM `citations` WHERE `citations`.`id` = 3 LIMIT 1
DELETE FROM `citations` WHERE `citations`.`id` = 3