app/controllers/sessions_controller.rb

  def create
    user = User.where(email: params[:email]).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'dev@safaracademy.org'  ORDER BY `users`.`id` ASC LIMIT 1