app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('dev@safaracademy.org', '$2a$10$BhFeghhL2BnJgGrI0BM1fe0lCq5V9hWUxh4z3Gvj6FueevxBo4.F.', '2016-11-03 12:47:56.485595', '2016-11-03 12:47:56.485595')
---
  def create
    @user = User.new(user_params)
    if @user.save